"""
    函数内存分配

"""
#   1. 程序自上而下执行def语句,会将函数代码存入内存的代码区域
#       函数体不执行
# def func01():
#     a=10

#   2.调用函数,会在内存中开辟一块空间,存储函数中创建的变量
#   3.函数执行过后,立马释放内存空间
# def func(p1,p2):
#     p1 = 20
#     p2[0] = 20
# data01 = 10
# data02 = [10]
# func(data01,data02)
# print(data01) # 10
# print(data02) # [20]
# #不可变类型的数据传参时,函数内部不可以改变原始数据
#可变类型的数据传参时.函数内部可以改变原数据
#   4.不用通过返回值也可得到修改后的结果


def func01(p1, p2, p3):
    p1 = ["b"]
    p2["a"] = "B"
    p3[0] = ["b"]
data01 = "a"
data02 = {"a": "A"}
data03 = ["a"]

