"""
    集合: 相当于只有键没有值的字典
        基础操作
            作用:去重复
"""
#   1.创建
#   -- 集合名 = {元素1,元素2,元素3}
#   -- 集合名 = set(其他容器)
#list=["a","b","c","d","d","f","f"]
#set01=set(list)
#print(set01)


#   2.添加
# set01.add()

#   3.定位(没有办法定位)

#   4.删除
#set01.remove()   #如果没有则报错
#set01.discard()  #如果没有不会报错

#   5.遍历
#   -- for 变量 in 集合名:

#   集合 -- 数学操作
#   1.交集&:返回共同元素

#   2.并集丨:或

#   3.补集-: s1={1,2,3}  s2={2,3,4}  s3=s1-s2={1}
#        ^:  s1^s2={1,4}

#   4.子集<: s1={1,2,3}  s2={1,2}   s2<s1
#     超集>:s1>s2


set_jl = {"曹操", "刘备", "孙权"}
set_js = {"曹操", "刘备", "张飞", "关羽"}
print("是经理也是技术的有", set_jl & set_js)
print("是经理不是技术的有", set_jl - set_js)
print("不是经理是技术的有", set_js - set_jl)
print("身兼一职的有", set_jl ^ set_js)
print("公司总共有", len(set_jl | set_js), "人")
